{"cleantext": "krishna kishore data scientist mob 91 email github profile overall 23 years experience technical expertise data machine learningartificial intelligence specialization deep learning cnn rnn natural language processing data engineering contributing growth organization professional highlights name company genpact current position data scientist experience years 23 years environment machine learning deep learning neural networks nlp job responsibilities data scientist building awesome machine learning model takes massive amounts seemingly worthless data produces insights worth weight gold using quantitative data generate business insights order help company make profits initial data investigation exploratory data analysis handling unstructured data reducing noise using eda process dimensionality reduction pca render unstructured data usable format determining correct data sets variables cleaning validating data ensure accuracy completeness uniformity choose one potential models algorithms devising applying models algorithms mine stores big data apply data science methods techniques machine learning statistical modeling artificial intelligence measure improve results presenting final results stakeholders make adjustments based feedback repeat process solve new problem skill set scripting languages python r c tools tableau algorithms machine learning deep learning neural networks database mysql packages tensor flow keras nltk scikit learn numpy pandas gensim projects 1 heritage foods profit prediction succeeding year team 4 members model keras regression duration 1 year 2 months heritage foods limited one largest private sector dairy enterprises southern india worked heritage project find expected price amount generated next year based various features highly correlated applied keras regression build model predict price process given tones data analyse consist many features mainly milk quantity cheese ghee quantity butter ice creams curd asked us predict profit next year sending new data features preprocessing analysed complete data performed imputation handling outliers correlation multi variate normality handled imbalance data set handle outliers used boxplot found data independent variables highly uncorrelated dependent variables used sampling solve found multi variate normality used log transforms normal distribution handled imbalance data set using sampling find weather model good fit using r squared removed unwanted columns building model used deep learning technique keras regression build model 2 topic modelling application team 5 members model latent dirichlet allocation lda duration going process tones documental data provided asked assign topic every documents topics names buyer seller buyer seller normal document normal data preprocessing preprocessing data done using nlp involves steps word tokenization lemmatization bag words tfidf vectorizer working process clean entire data representing integers matrix format building model preprocessing lda used building model lda assign topic document lda lda process used build model assign topics text data format intigers works based probability final outcome highly accurate education graduated sv university 80 aggregate board intermediate education narayana junior college 823 board secondary education vignana deepti 93 declaration hereby declare said information true best knowledge bangalore j krishna kishore", "education": [], "emails": ["krishnakishorereddyj@gmail.com"], "experience": "23", "industry_domain": ["MachineLearning", "Mechanicalengineer", "Marketing", "Finance", "DeepLearning"], "job_title": ["MachineLearning", "Mechanicalengineer", "Marketing", "Finance", "DeepLearning"], "keyphrases": ["krishna kishore", "data scientist", "mob", "email github profile", "23 years experience", "technical expertise", "data", "machine learningartificial intelligence specialization", "deep learning", "cnn rnn", "natural language processing", "data engineering", "current position", "years", "23 years", "environment", "machine learning", "deep learning", "neural networks", "nlp job responsibilities", "awesome machine learning model", "massive amounts", "insights", "quantitative data", "business insights", "order", "company", "profits", "exploratory data analysis", "unstructured data", "noise", "eda", "unstructured data", "correct data sets", "validating data", "accuracy", "completeness", "models", "big data", "apply data science methods techniques", "machine learning", "statistical modeling", "artificial intelligence", "measure", "results", "final results", "stakeholders", "adjustments", "new problem skill set", "python r c tools", "tableau algorithms", "machine learning", "deep learning neural networks database mysql packages", "tensor flow keras nltk scikit learn numpy pandas gensim projects", "1 heritage foods profit prediction", "succeeding year team 4 members model keras regression duration", "1 year", "2 months", "heritage foods limited", "one largest private sector dairy enterprises", "southern india", "worked heritage project", "expected price amount", "various features", "keras regression build model", "price process", "many features", "milk quantity", "cheese ghee quantity", "butter ice creams curd", "profit", "complete data", "multi variate normality", "found data independent variables", "highly uncorrelated dependent variables", "sampling solve found multi variate normality", "log transforms", "normal distribution", "sampling find weather model", "r squared removed unwanted columns", "building model", "deep learning technique", "keras regression build model", "2 topic modelling application team", "5 members model", "latent dirichlet allocation", "lda duration", "going process", "tones", "assign topic every documents topics names", "buyer", "seller", "buyer seller", "normal document", "normal data", "nlp", "steps", "word tokenization", "lemmatization bag words tfidf vectorizer", "working process", "integers", "building model", "assign topic document", "build model", "assign topics", "text data format", "intigers", "works based probability", "final outcome", "highly accurate education", "graduated", "sv university", "80 aggregate board intermediate education", "narayana junior college", "823 board", "secondary education", "vignana deepti", "93 declaration", "said information"], "language_known": [], "location": ["bangalore"], "name": "krishna kishore", "phones": ["6302395997"], "raw_text": "                                                                                    \n\n  Krishna Kishore                                              \n    Data Scientist \n\n              \n                                                                                                  \n\n \n      Mob: +91 6302395997 \n      Email: krishnakishorereddyj@gmail.com \n      Github: https://github.com/krishnakish                                          \n \nPROFILE \n \n\n  Overall  2.3  Years  of  experience  in  technical  expertise  in  Data  Machine  Learning/Artificial \n\nIntelligence with specialization in Deep Learning (CNN, RNN), Natural Language Processing \n\nand Data Engineering by contributing to growth of the organization. \n\n \nProfessional Highlights \n \nName of company: GENPACT \n\nCurrent Position: Data Scientist \n\nExperience in years: 2.3 years \n\nEnvironment: Machine Learning, Deep Learning (Neural Networks), NLP. \n\n \n\nJob Responsibilities as  Data Scientist. \n\n  Building an awesome machine learning model that takes in massive amounts of \n\nseemingly worthless data and produces insights worth their weight in gold. \n\n  Using quantitative data to generate business insights in order to help company make \n\nmore profits. \n\n \n\nInitial data investigation and exploratory data analysis. \n\n  Handling unstructured data and reducing noise using EDA process. \n\n  Dimensionality reduction (PCA) to render all that unstructured data into a usable format. \n\n  Determining the correct data sets and variables. \n\n  Cleaning and validating the data to ensure accuracy, completeness, and uniformity. \n\n  Choose one or more potential models and algorithms. \n\n  Devising and applying models and algorithms to mine the stores of big data \n\n  Apply data science methods and techniques, such as machine learning, statistical \n\nmodeling, and artificial intelligence. \n\n  Measure and improve results. \n\n\f  Presenting final results to stakeholders. \n\n  Make adjustments based on feedback. \n\n  Repeat the process to solve a new problem. \n\nSkill Set \n\n  Scripting Languages        : Python, R,c \n\n  Tools                             : Tableau \n\n  Algorithms                     : Machine Learning, Deep Learning (Neural Networks). \n\n  Database   \n\n \n\n : MySQL. \n\n \n\n  Packages                        : Tensor flow, Keras, NLTK, scikit learn, Numpy, Pandas, gensim. \n\n \n\n  Projects \n\n1)  Heritage foods profit prediction for succeeding year. \n\nTeam: 4 members \n\n Model : Keras Regression \n\n Duration : 1 year 2 months \n\n  Heritage Foods Limited is one of the largest private sector dairy enterprises in southern         \n\nIndia. \n\n  Worked on a Heritage project to find out expected price amount that can be generated for \n\nnext year based on various features which is highly correlated to each other and applied \n\nKeras Regression to build model and predict price. \n\n  Process : Given tones of data to analyse which consist of many features mainly milk \n\nquantity, cheese, ghee quantity, butter, ice creams, curd and so on... \n\n  Asked us to predict profit for next year by sending new data of same features. \n\n  Preprocessing : Analysed complete data performed imputation, handling outliers, \n\ncorrelation, multi variate normality, handled imbalance data set \n\n  To handle outliers I used boxplot and I found data is independent variables are highly \n\nuncorrelated by dependent variables so I used up sampling to solve, found there is no \n\nmulti variate normality used log transforms for normal distribution. \n\n  Handled imbalance data set using up sampling to find weather model is a good fit or not \n\nusing R squared, and removed unwanted columns. \n\n\f  Building model : Used deep learning technique Keras Regression to build model. \n\n---------------------------------------------------------------------------------------------------------------- \n\n \n\n       2) Topic modelling for an application.   \n\n  Team : 5 members \n\n  Model : Latent Dirichlet Allocation(LDA) \n\n  Duration : On going \n\n  Process: Tones of documental data has been provided and asked then to assign topic for \n\nevery documents and topics names are Buyer, Seller Buyer and Seller Normal document \n\nwith normal data \n\n  Preprocessing:  Preprocessing  of  data  is  done  by  using  NLP  that  involves  steps  word \n\ntokenization, lemmatization, bag of words and TF-IDF Vectorizer \n\n  Working on above process to clean entire data and representing it into integers in matrix \n\nformat. \n\n  Building  Model:  After  preprocessing  LDA  is  used  for  building  model  LDA  does  assign \n\nTopic for each document. \n\n  LDA : LDA is a process used to build a model to assign topics for text data which is in the \n\nformat of intigers \n\n  This works based on  probability where its final outcome is highly accurate. \n\nEducation: \n\n  Graduated from SV university with 80% aggregate \n\n  Board of Intermediate Education, Narayana Junior College with 82.3%. \n\n  Board of Secondary Education, Vignana Deepti, with 93%. \n\nDeclaration: \n\nI hereby declare that the above said information’s are true to the best of my knowledge. \n\nBangalore \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nJ Krishna Kishore \n\n\f", "resume_file": "Resumejkishnakishore_2", "technical_skills": ["keras", "algorithms", "deep learning neural networks nlp", "data usable", "c", "dimensionality reduction", "topic modelling", "data science", "numpy", "latent dirichlet", "artificial intelligence", "deep learning cnn", "python", "deep learning neural networks database", "rnn", "nlp", "probability", "noise using eda", "deep learning", "data machine", "github", "data engineering", "languages", "tensor flow", "data preprocessing", "data scientist", "mysql"]}