{"cleantext": "bhagwanti verma block 88 gulab vatika society old padra road nr tandelja baroda390020 contact 0 email market research statistical analyst sas analyst profile exposure global processes teamwork across various locations cultures desirable proficiency deep learning framework tensorflow keras proficiency python basic libraries machine learning scikitlearn pandas expertise visualizing manipulating big datasets proficiency opencv ability select hardware run ml model required latency responsibilities understanding business objectives developing models help achieve along metrics track progress managing available resources hardware data personnel deadlines met analyzing ml algorithms could used solve given problem ranking success probability exploring visualizing data gain understanding identifying differences data distribution could affect performance deploying model real world verifying data quality andor ensuring via data cleaning supervising data acquisition process data needed finding available datasets online could used training defining preprocessing feature engineering done given dataset defining data augmentation pipelines training models tuning hyperparameters key excel resolving client queries faster better solutions training desk sit root cause analysis systems process improvements proven increase efficiency customer satisfaction possess strong understanding specific business processes addressed along ability bridge gap business client requirement proficient creating joining merging dataset using sas base proc sql strong interpersonalcommunication skills oral written confidence work analytics group levels management selfmotivated ability make decisions absence detailed instructions customer focused highly successful building relationships key decision makers seizing control critical problem areas delivering customer commitments rich experience delivering optimal results ethical value students demonstrated capabilities establishing good academics results along discipline institute core competencies python ml aisas base9 business analyst training development team handlingteam management cross functional coordination work experience tata consutancy services jan 2011 may 2019 business process analyst learn different process market research business understand complete flow retail measurement helping identifying cause effect final deliverables identify investigate coordinate resolution data process product related queries creating standard operating procedure end users drive business smoothly reduce quality escapes drive convergence input validation process across different countries need work sql making queries providing desired output clients demonstrated experience modeling data quality data tracing data mapping statistical analysis econometrics data mining preferred able work large volumes data disparate sources support onshore well offshore users knowledge base difficultiesquestions taking lead transition shoring new countries existing process handling team 4 data validation department assigning work improving skills efficiency according knowledge communicating clients understand work better way deliver onbefore deadlines working data validation team dealing retailer data market research validating correcting retailer data used preparation final reports client need get engaged different projects helping increasing productivity quality final outputs training new associatesexperienced associates improve productivity root cause analysis government engineering college 2005 2010 visiting lecturer working visiting lecturer mathematics 2005 2009 government engineering college dahod completely acquainted math syllabus gtu gujarat tech uni job profile complete syllabus time set internal exam question paper well assess also given responsibilities assessing university answer paper entire semester student teaching math semester student engineering college academia math 2005 sardar patel university v v nagar gujarat math 2003 sardar patel university v v nagar gujarat professional qualification python ml ai sas base sas 9 certified sas programmer certificate bp048953v9 technical skills sas tools sassql sasmacro sasods version sas 913 machine learning ai python 372 database package sql oracle spread sheet packages excel word power point date birth 19th november 1982", "education": [], "emails": ["bhagwanti.verma@yahoo.com"], "experience": "1982", "industry_domain": ["ComputationalFluidDynamics", "Accounting", "Mechanicalengineer", "AerospaceEngineering", "DataEngineering", "Marketing", "MachineLearning"], "job_title": ["ComputationalFluidDynamics", "Accounting", "Mechanicalengineer", "AerospaceEngineering", "DataEngineering", "Marketing", "MachineLearning"], "keyphrases": ["bhagwanti verma", "block", "gulab vatika society", "old padra road", "nr", "tandelja baroda390020", "contact", "email market research", "statistical analyst", "sas analyst profile", "exposure", "global processes", "teamwork", "various locations", "deep learning framework tensorflow keras proficiency", "python basic libraries", "machine learning", "big datasets", "business objectives", "models", "metrics", "available resources", "problem", "data gain", "differences", "data distribution", "performance", "model", "data quality", "data cleaning", "data acquisition", "process data", "available datasets", "preprocessing", "feature engineering", "given dataset defining data augmentation pipelines", "training models", "hyperparameters", "client queries", "proven increase efficiency", "strong understanding", "specific business processes", "ability bridge gap", "dataset", "sas base proc sql strong interpersonalcommunication skills", "decisions", "control", "customer commitments", "rich experience", "optimal results", "ethical value", "students", "capabilities", "good academics results", "discipline", "ml aisas base9 business analyst training development team handlingteam management", "cross functional coordination", "work experience", "different process market research", "complete flow retail measurement", "cause effect", "coordinate resolution data", "product related queries", "standard operating procedure", "business", "quality", "different countries", "work sql making queries", "desired output", "experience", "statistical analysis", "data disparate sources", "support onshore well offshore users knowledge base", "difficultiesquestions taking lead transition shoring new countries existing process handling", "team", "4 data validation department", "work", "skills efficiency", "knowledge", "clients", "work", "deadlines", "dealing retailer data market research", "retailer data", "preparation", "final reports", "productivity", "final outputs", "productivity", "root cause analysis", "2005 2010 visiting lecturer", "working visiting lecturer", "mathematics", "government engineering college", "math syllabus", "gtu gujarat tech uni job profile", "complete syllabus", "responsibilities", "teaching", "math semester student", "engineering college", "academia", "math", "2005 sardar patel university", "nagar gujarat math", "2003 sardar patel university", "v nagar gujarat", "professional qualification", "python ml ai sas base sas", "certified sas programmer certificate", "technical skills", "sas tools sassql sasmacro sasods version sas"], "language_known": [], "location": ["dahod"], "name": "bhagwanti verma block", "phones": ["0966251351"], "raw_text": "BHAGWANTI S VERMA\nBlock no 88, Gulab Vatika Society, Old Padra Road, Nr Tandelja, Baroda-390020\nContact: 09662513510  E-mail: bhagwanti.verma@yahoo.com\nMARKET RESEARCH ~ STATISTICAL ANALYST~ SAS ANALYST\n\n\nPROFILE:\nExposure to global processes and teamwork across various locations and cultures desirable.\nProficiency with a deep learning framework such as TensorFlow or Keras Proficiency with Python and basic libraries for machine learning such as scikit-learn and pandas \nExpertise in visualizing and manipulating big datasets Proficiency with OpenCV \nAbility to select hardware to run an ML model with the required latency \nResponsibilities Understanding business objectives and developing models that help to achieve them, along with metrics to track their progress Managing available resources such as hardware, data, and personnel so that deadlines are met \nAnalyzing the ML algorithms that could be used to solve a given problem and ranking them by their success probability \nExploring and visualizing data to gain an understanding of it, then identifying differences in data distribution that could affect performance when deploying the model in the real world \nVerifying data quality, and/or ensuring it via data cleaning \nSupervising the data acquisition process if more data is needed \nFinding available datasets online that could be used for training \nDefining the pre-processing or feature engineering to be done on a given dataset Defining data augmentation pipelines Training models and tuning their hyperparameters \nKey Excel in resolving client queries with faster & better solutions through training and desk sit root cause analysis, systems and process improvements proven to increase efficiency, customer satisfaction.\nPossess a very strong understanding of the specific business processes being addressed, along with the ability to bridge the gap between the business & Client requirement. \nProficient in Creating, Joining and Merging Dataset using SAS Base and Proc SQL\nStrong interpersonal/communication skills (oral and written) and confidence to work with Analytics group and all levels of management.\nSelf-motivated with the ability to make decisions in the absence of detailed instructions.\nCustomer focused, highly successful in building relationships with key decision makers, seizing control of critical problem areas and delivering on customer commitments\nRich experience in delivering optimal results & Ethical value to students. Demonstrated capabilities in establishing good academics results along with discipline of the institute.\n\n\nCore Competencies:\nPython ML&AISAS Base9 Business Analyst Training & Development  Team HandlingTeam Management Cross Functional Coordination\n\n\nWORK EXPERIENCE\n\nTATA CONSUTANCY SERVICES\t\t\t\t\t\t\t              Jan 2011- May 2019\nBusiness Process Analyst\n\nHad to learn different process of market Research Business to understand the complete flow of Retail Measurement, this was helping in identifying cause effect on final deliverables.\nHad to identify, investigate and co-ordinate the resolution of data, process or product related queries.\nCreating Standard Operating procedure for all the end users to drive business smoothly and to reduce quality escapes\nHad to drive convergence for INPUT Validation process across different countries\nNeed to work on SQL in making queries and providing desired output to clients.\nDemonstrated experience in modeling data quality data tracing data mapping statistical analysis econometrics and / or data mining preferred.\nAble to work with large volumes of data from disparate sources.\nHad to support for Onshore as well as offshore users for any knowledge base difficulties/questions\nTaking lead in transition(off shoring) of new Countries for the existing process \nHandling a team of 4 for the data validation department, assigning work to them and improving their skills and efficiency according to their knowledge\nCommunicating with clients to understand work in more better way so that we can deliver it on/before deadlines\nWorking for data validation team, this is dealing with retailer data for the market research. Validating and correcting the retailer data, this will be used in preparation of final reports to the client\nNeed to get engaged in different projects which was helping in increasing productivity and quality of the final outputs, Training new associates/experienced associates to improve productivity, Root cause analysis\n\n\n\n\n\nGOVERNMENT ENGINEERING COLLEGE \t\t\t\t\t\t\t\t     2005- 2010 \nVisiting Lecturer\n\nI was working as a Visiting Lecturer for mathematics from 2005 to 2009 at Government engineering college Dahod.\nI am completely acquainted with the math’s syllabus of GTU(Gujarat Tech Uni)\nMy job profile there was to complete the syllabus in time. Set the Internal Exam question paper as well to assess them.\nI was also given the responsibilities of assessing the University Answer paper of the entire semester student.\nI was teaching Math’s to all the semester student of Engineering College \n\n\nACADEMIA\n\nMaster of Science (Math’s), 2005\nSardar Patel University, V. V. Nagar, Gujarat,\t\n\nBachelor of Science (Math’s), 2003\nSardar Patel University, V. V. Nagar, Gujarat,\n\nProfessional Qualification\nPython (ML&AI)\nSAS (Base SAS 9)\nCertified SAS Programmer\nCertificate No: BP048953v9\n\n\nTechnical Skills: \nSAS Tools: \tSAS/SQL, SAS/macro and SAS/ODS.\nVersion: \tSAS 9.1.3\n\nMachine Learning & AI: Python 3.7.2\n\nDatabase package: SQL, Oracle\n\nSpread Sheet Packages:  Excel, Word, Power Point\n\n\n\nDate of Birth: 19th of November, 1982.\t\t\t   \t\t\t\t\n", "resume_file": "ResumeBhagwantiVerma", "technical_skills": ["python", "data mining", "operating procedure end", "keras", "certificate", "ranking", "algorithms", "deep learning framework tensorflow", "analytics", "sql", "business", "engineering", "knowledge base", "support", "probability", "libraries"]}