{"cleantext": "raghunandan mj 1217 1 st george road singapore 320001 mobile 65 9336 1092 dob 15 feb 1983 fin g5265778x email objective work competitive environment challenging assignments contribute quality ideas work yield twin benefits job satisfaction steadypaced professional growth work experience total experience 9 years hedge fund valuations fund administration asset management domains key products otc products credit default swaps interest rate swaps fx options fx forwards listed products equities corporate bonds futures cfd paxus accounting software bloomberg project details apex fund services singapore pte ltd senior account manager july 2016 present operational onboarding new takeon funds including drafting admin agreements preparation project plans take funds ensuring take funds onboarded efficiently administrators currently managing team 10 people comprising account managers supervisors senior fund accountants reviewing fund ppm providing comments lawyers incorporate changes wherever essential liasing prime brokers custodians ensure corporate actions processed accurately preparation service level agreement sla operational procedure documents implementation refinement ssae 16 controls experienced calculation performance fees equalisation series accounting reviewing net asset value nav detail ensuring navs delivered efficiently clients per sla dealing transfer agency functions amlkyc reviews new subscriptions ensuring compliance regulatory requirements requirements funds specifications preparation review financial statements required annually sfrs ifrs gaap ability deal auditors external internal manage respond audit queries experienced fatca data accumulation well new crs reporting requirements conducting regular team meetings allocation projects staff development training monitoring completion kras account manager may 2012 jun 2016 reviewing net asset value nav detail ensuring navs delivered efficiently clients per sla liasing prime brokers investment managers regular basis ensure trades captured cash balances reconciled thus ensuring prime broker share holding positions line adminstrator perform due diligence checks assisting clients new account opening ensure aml compliance regulatory reporting ensuring shareholder statements delivered time shareholder queries answered promptly quarterly completion opera reporting supervision training recruitment accounting staff northern trust custodian bank senior fund accountant oct 2007 feb 2012 computation net asset value nav american pension plans 401k plans performing valuations mutual funds bonds actively managed funds derivate instruments valuations like swaps futures options reviewing reconciliations payments receipt funds subscription redemption funds accounting ledger transactions accounting daily transactions accounts receivables payables monitoring closing transactions cash book ledger system generation standard adhoc financial reports monthly quarterly yearly basis actively involved transition funds baker hughes goodyear corporation education finance 2005 2007 sjce college mysore india finance 2001 2004 mahajanas degree college mysore india", "education": [], "emails": ["raghunandan.mj@gmail.com"], "experience": "2004", "industry_domain": ["Accounting", "HumanResources", "DesignEngineer", "Mechanicalengineer", "Finance"], "job_title": ["accountant"], "keyphrases": ["mj", "1217 1 st", "george road", "singapore", "mobile", "65 9336 1092 dob", "feb", "fin", "g5265778x", "email", "competitive environment", "quality ideas work yield", "twin benefits", "job satisfaction", "steadypaced professional growth work experience", "total experience", "9 years", "hedge fund valuations", "fund administration", "asset management domains", "key products", "otc products credit default swaps interest rate swaps", "fx options", "fx forwards listed products", "equities corporate bonds futures cfd paxus accounting software", "bloomberg project details", "apex fund services singapore pte ltd senior account manager", "july 2016 present operational onboarding", "admin agreements", "funds", "administrators currently managing team", "10 people", "account managers", "supervisors", "senior fund accountants", "fund", "comments", "changes", "prime brokers custodians", "corporate actions", "controls experienced calculation performance fees", "net asset value", "navs", "sla dealing transfer agency functions", "amlkyc", "new subscriptions", "compliance", "regulatory requirements", "requirements", "funds specifications preparation review financial statements", "sfrs ifrs gaap ability deal auditors external internal manage respond audit queries experienced fatca data accumulation", "new crs reporting requirements", "regular team meetings", "allocation projects staff development training monitoring completion", "kras account manager", "net asset value", "navs", "sla", "trades", "prime broker share holding positions", "line adminstrator", "due diligence checks", "clients", "aml compliance regulatory reporting", "shareholder statements", "shareholder queries", "2007 feb", "nav american pension plans 401k plans", "performing valuations", "mutual funds", "bonds", "actively managed funds derivate instruments valuations", "swaps futures options", "reconciliations", "accounting ledger transactions", "accounting", "daily transactions accounts receivables payables monitoring closing transactions", "standard adhoc financial reports", "monthly quarterly yearly basis", "actively involved", "transition funds", "baker hughes goodyear corporation education finance", "2005 2007 sjce college", "mysore india finance", "mahajanas degree college"], "language_known": [], "location": ["singapore", "mysore india"], "name": "raghunandan mj", "phones": [], "raw_text": "Raghunandan MJ\t\t\t\t\t\n#12-17, 1 St. George’s Road\nSingapore- 320001\nMobile: +65 9336 1092\nDOB: 15 – Feb – 1983\nFIN: G5265778X\nEmail : raghunandan.mj@gmail.com\n\nObjective\nTo work in a competitive environment on challenging assignments where I can contribute quality ideas, work and yield the twin benefits of job satisfaction and steady-paced professional growth.\nWork Experience\nTotal experience of 9+ years in Hedge Fund Valuations in both Fund Administration and Asset Management domains.\n\nKey Products \nOTC products - Credit Default Swaps, Interest Rate Swaps, FX Options and FX Forwards.\nListed products – Equities, Corporate Bonds, Futures and CFD’s.\nPaxus Accounting Software & Bloomberg.\n\nProject Details\nApex Fund Services Singapore Pte Ltd.\nSenior Account Manager                              \t\t\tJuly 2016 – Present\n\nOperational on-boarding of new and take-on funds including drafting of Admin agreements and preparation of project plans for take on funds and ensuring take on funds are on-boarded efficiently from other administrators.\nCurrently managing a team of 10 people comprising of account managers, supervisors and senior fund accountants.\nReviewing the fund’s PPM and providing comments to lawyers to incorporate the changes wherever essential.\nLiasing with prime brokers and custodians to ensure corporate actions are processed accurately.\nPreparation of Service Level Agreement (SLA) and Operational Procedure documents.\nImplementation and refinement of SSAE 16 controls.\nExperienced in calculation of Performance Fees – Equalisation and Series Accounting.\nReviewing the Net Asset Value (NAV) in detail and ensuring that the NAVs are delivered efficiently to the clients as per SLA.\nDealing with Transfer Agency Functions - AML/KYC reviews for new subscriptions.\nEnsuring compliance with regulatory requirements and other requirements of the funds specifications.\nPreparation and review of financial statements as required annually (SFRS, IFRS and GAAP).\nAbility to deal with auditors (external and internal) and manage and respond to audit queries.\nExperienced in FATCA data accumulation as well as the new CRS reporting requirements.\nConducting regular team meetings and allocation of projects.\nStaff development training, monitoring and completion of KRAs.\n\n  Account Manager                              \t\t\t\t  May 2012 – Jun 2016\n\nReviewing the Net Asset Value (NAV) in detail and ensuring that the NAVs are delivered efficiently to the clients as per SLA.\nLiasing with Prime Brokers and Investment Managers on a regular basis to ensure that all the trades are captured and cash balances are reconciled, thus ensuring that the prime broker share holding positions are in line with the Adminstrator.\nPerform due diligence checks while assisting the clients during new account opening and ensure the AML compliance with regulatory reporting.\nEnsuring that all the shareholder statements are delivered on time and the shareholder queries are answered promptly.\nQuarterly completion of OPERA reporting..\nSupervision , training and recruitment of accounting staff.\n\n\nNorthern Trust Custodian Bank\nSenior Fund Accountant                                 \t\t\t Oct 2007 – Feb 2012\n\nComputation of Net Asset Value (NAV) for American pension plans (401k Plans).  Performing valuations for Mutual Funds, Bonds,  Actively managed Funds,  Derivate Instruments Valuations like Swaps, Futures and Options.\nReviewing Reconciliations of payments and receipt of funds. (Subscription and Redemption of   Funds on accounting ledger transactions.\nAccounting daily transactions of accounts receivables and payables and monitoring the closing transactions on cash book ledger system.\nGeneration of standard and Adhoc Financial Reports on a monthly, quarterly and yearly basis.\nActively involved in the transition of the funds for Baker Hughes and Goodyear Corporation.\n\nEducation\n\nMaster of Business Administration (Finance)\t\t          \t                               2005 – 2007 \nSJCE College, Mysore, India\n\nBachelor of Business Management  (Finance)\t\t\t              \t        2001 – 2004\nMahajanas Degree College, Mysore, India", "resume_file": "Apex_Raghunandan_MJ_Senior_Acc_Mgr", "technical_skills": ["finance", "payments", "accounting", "computation", "software", "mobile", "monitoring"]}