{"cleantext": "sagarhyadav engineer insagaryadav22713a156 sgr1356 technical skills overview data analytics machine learning full stack dev computer engineering project management python dev programming python django javascript sql mongodb postgresql experience dec 2017 database administrator jan 2018 informatrix pvt ltd focused developing mysql technologies linux virtual machines mysql ver 5525 sql servers create redundant mysql server setup also use ful terms data security failover solution database backup scaleout solutions slave project 1 masterslave setup 2 real time covid19 outbreak notification system covid19 data accessible mohfwgovin utilizing python content beautiful soup plyer libraries naturally following 1 hour data covid19 showed windows notice framework 3 motor vehicle collisions data 3d interactive map visualize plot filtering data 3d interactive map charts histograms build data science web app streamlit library python 4 student profile application students enroll afterward login substantial data update information furthermore manual administrator board administrator erase student details 5 hospital management web application receptionist heshe ready include see erase doctor patient ap pointment information table fare download information csv excel pdf format certification june 2020 machine learning basic aws training machine learning deep learning machine learning pipeline data science web app streamlit python coursera visualize data map filtering data interactive tables plot filtered data 3d interactive map charts histograms python data science ibm reading writing files open loading data pandas working saving data pandas learn code web futurelearn learnt roles html css javascript making web pages sitesexperiment code existing web pages using browser developer tools project management essential certified learnt essentials project management msi may 2020 may 2020 june 2020 honours awards smart india hackthon 2018 division level athlete represent vidarbh multiple times awarded mrdbacer fashion show competition c c html bootstrap june 2020 education beng computer science engineering cgpa696 specialization computer science university nagpur 2015 2019 nagpur maharashtra hsc computer science per5892 maharashtra state board 2013 2015 nagpur maharashtra ssc per7000 maharashtra state board 2013 nagpur maharashtra", "education": ["ssc", "hsc"], "emails": ["sagaryadav161997@gmail.com"], "experience": "5525", "industry_domain": ["Medical", "AutomobileEngineering", "Mechanicalengineer", "DataEngineering", "MachineLearning"], "job_title": ["Medical", "AutomobileEngineering", "Mechanicalengineer", "DataEngineering", "MachineLearning"], "keyphrases": ["sagarhyadav engineer", "insagaryadav22713a156", "sgr1356 technical skills overview", "data analytics machine learning full stack dev computer engineering project management", "python dev", "programming", "python django javascript sql mongodb postgresql experience", "informatrix pvt ltd", "mysql ver", "sql servers", "redundant mysql server setup", "ful terms data security failover solution database backup scaleout solutions", "slave project", "1 masterslave setup", "2 real time covid19 outbreak notification system", "covid19 data accessible mohfwgovin", "python content beautiful soup plyer libraries", "covid19", "windows notice framework", "3 motor vehicle collisions data", "3d interactive map", "visualize plot filtering data", "3d interactive map charts histograms build data science web app", "streamlit library", "python", "substantial data update information", "furthermore manual administrator board administrator erase student details", "heshe", "machine learning", "basic aws training", "machine learning", "deep learning", "machine learning", "streamlit python coursera visualize data map filtering data", "interactive tables", "plot filtered data", "3d interactive map charts histograms python data science ibm reading writing files", "open loading data", "pandas working saving data", "pandas learn code", "web futurelearn learnt roles html css javascript making web pages", "sitesexperiment code", "existing web pages", "browser", "developer tools", "certified", "learnt", "essentials", "msi", "honours", "awards", "smart india hackthon", "2018 division level", "athlete", "vidarbh", "mrdbacer fashion show competition", "html bootstrap", "education beng computer science engineering", "cgpa696", "specialization computer science university", "nagpur maharashtra ssc per7000", "maharashtra state board", "maharashtra"], "language_known": [], "location": ["nagpur", "per5892", "vidarbh", "maharashtra", "per7000"], "name": "insagaryadav22713a156 sgr1356", "phones": ["9022516902"], "raw_text": "SAGAR.H.YADAV\nEngineer\n\n 9022516902\n sagaryadav161997@gmail.com\n /in/sagar-yadav-22713a156\n Sgr1356\n\nTechnical Skills\nOverview\n\nData\n\nAnalytics\n\nMachine\nLearning\n\nFull Stack\n\nDev\n\nComputer\nEngineering\n\nproject\n\nManagement\n\nPython\n\nDev\n\nProgramming\nPython • Django• JavaScript\n\nSQL • MongoDB • PostgreSQL\n\nExperience\nDec 2017 - Database Administrator\nJan 2018\n\nInformatrix pvt ltd\n\n• Focused on developing MySQL Master and Slave Replication.\n\nTechnologies - Linux, Virtual Machines, MySQL ver 5.5.25, SQL\nServers\n\n• To create a redundant MySQL server setup which is also very use-\nful in terms of Data Security, Fail-over Solution, Database Backup,\nScale-out solutions from Slave.\n\nProject\n1] Master and Slave Replication in MySQL:-\n”Master-Slave” setup where the master database is the original storage machine\nand the slave is the recipient of the replicated data.\n2] Real time Covid-19 Outbreak Notiﬁcation System :-\nIn this, Covid-19 data is accessible on Mohfw.gov.in by utilizing a python content\nwith Beautiful Soup and Plyer libraries naturally following 1 hour data of Covid-19\nwill showed in windows notice framework.\n3] Motor Vehicle Collisions Data with 3D Interactive Map :-\nVisualize, plot Filtering Data on a 3D Interactive Map, Charts and Histograms and\nbuild data science web app with the Streamlit library in Python.\n4] Student Proﬁle Application :-\nIn this students can enroll themselves and afterward login with substantial data and\ncan update there information ,and furthermore have a manual administrator board\nwhere administrator can erase the student Details.\n5] Hospital Management Web Application :-\nAs a Receptionist He/She can ready to include see or erase doctor patient and ap-\npointment and have an information table fare to download information in CSV, Excel\nand pdf Format.\n\nCertification\nJune 2020 Machine Learning Basic\n\nAWS Training\n\nMachine Learning , Deep Learning ,machine Learning Pipeline\n\nData Science Web App with Streamlit and Python\ncoursera\nVisualize Data on a Map, Filtering Data and Interactive Tables, Plot\nFiltered Data on a 3D Interactive Map, Charts and Histograms\nPython For Data Science\nIBM\nReading,Writing ﬁles with open, Loading data with Pandas, Working\nwith and Saving data with Pandas\nLearn to Code for Web\nFuturelearn\nLearnt the roles of HTML, CSS and JavaScript in making web pages\nand sites.Experiment with the code of existing web pages using\nbrowser developer tools.\nProject management Essential Certiﬁed\nLearnt the Essentials of Project Management\n\nMSI\n\nMay 2020\n\nMay 2020\n\nJune 2020\n\nHonours and Awards\n\n• Smart India Hackthon 2018\n• Division level Athlete And represent Vidarbh multiple times\n• Awarded MR.DBACER in Fashion Show Competition\n\nC • C++ • HTML • Bootstrap\n\nJune 2020\n\nEducation\nBEng , Computer Science Engineering\n(CGPA:6.96 )\nSpecialization: Computer Science\nUniversity of Nagpur\n2015 - 2019 | Nagpur, Maharashtra\n\nH.S.C ,Computer Science (Per:58.92 )\nMaharashtra State Board\n2013 - 2015 | Nagpur, Maharashtra\n\nS.S.C (Per:70.00 )\nMaharashtra State Board\n2013 | Nagpur, Maharashtra\n\n\f", "resume_file": "ResumeSagarYadav", "technical_skills": ["linux", "engineering", "framework", "javascript", "library", "windows", "data accessible", "computer science", "libraries", "collisions", "data science", "analytics", "python", "erase", "security", "plot filtering", "dev", "sql", "deep learning machine", "html", "css", "project management", "server", "mysql"]}