{"cleantext": "akbar quraishi pune india 91 highly motivated electrical engineer experience r software computer vision applications florida state university united states additional experience includes programming c python create solutions interfaces support main applications quick learner desires acquire knowledge latest technologies get involved challenging work linkedin linkedincominakbarquraishi github githubcomakbarmq01 angellist angelcoamq14 languages technologies proficient python ros c c opencv numpy pytorch keras deep learning gstreamer nvidia deepstream sdk docker kubernetes darknet exposure deep learning models yolo fastrcnn resnet unet neural networks professional experience yantraai technologies computer vision engineer pune building industrial use case applications based deep learning applications video analytics deepstream 2019 present development human safety application nvidiadeepstream sdk using yolov3 model gstreamer pipeline set multiple video streams worked homography tool using opencv track object movement 2d map deep inspector yantra building product industrial inspection classification detection deep learning models tested performance modules hardware verify industry appropriate performance set jenkins pipeline automated testing robotic cell manager optical character recognition ocr digital meter reading creating ssh api communication edge device host machine setting object detection model nvidia xavier safety gear detections warehouse security building gstreamer pipelines deepstream sdk deep learning based object detection module camera calibrations reduce distortions 2017 2018 florida state university teaching assistant eel 3705 digital logic design assisted students understanding digital logic concepts flipflops latches state machines instructed lab sessions supervised projects altera de2115 cyclone ivfpga quatrus prime eel 474 6 microcontroller based system design completion objectives using energia code composer studio ides designed lab session ti mspexp430f5529lp microcontroller assisted students successful florida department transportation computer engineer research assistant 2015 2016 prototyped design rectification circuit provide interface lightning surge input pic24 processor resulting analysis peakdrop curve collects researches specific client requirements projects identifies requirements gathers workflow data basic system reporting specifications prototyped design rectification circuit provide interface lightning surge input pic24 processor using opc concept resulting analysis peakdrop curve designed ad converter programmed mplab pic24 kit sampling 820s surge utilizing embedded c automated data sampling python backup data ssd avoid device failure analysed collected data surges performed data sampling verify existing protection standards performed spd testing following ieee c62412 standards published traffic engineering operations education ms electrical engineering florida state university us bs electrical electronics engineering rgtu india academic projects modeling dynamic performance apr18650 lithiumion cell electrical engineer analysis eis model comparing experimental simulated results liion cell 2016 2013 2018 2014 2012 performed charge discharge cycles dut different c rates using neware battery analyser used mathematical model simulink liion cell get simulated chargedischarge profiles compare experimental results results showed model proposed could used study real time operations liion batteries test performed mathematical modelling lio battery matlabc understand verify battery discharge dynamics 2017 yelpcamp software engineer web application allows uses explore share experience camping sites yelpcamp designed ui using vanilla js html5css ui semantic target users common outdoor activities used mean stack restful routing concepts keep entire application use javascript helped developers easily understand follow code integrated passport js middleware user authentication prevented malicious user alter database quasi static load flow analysis electrical engineer load flow fault analysis new england bus system power grid pv injection 2015 reduced runtime 20 implementing newton raphson algorithm load flow studies python studied impact transients transients pv connected bus performed load load analysis remaining buses system discussed vulnerability grid pv installation various bus locations showed impact without pv adjacent bus awards certifications 2nd place state inter college senior design expo rgtu trainee bharat heavy electricals limited crompton greaves skills training deployment deep learning models pytorch keras automating software applications using shell perl scripts linux os gstreamer pipeline buildup basler camera object classification module deepstream experience creating regression artificial neural network models svms decision trees etc key courses computer networks security wireless networks microprocessors microcontrollers computer system architecture languages english hindi urdu", "education": ["bs", "ms"], "emails": ["akbarmq01@gmail.com"], "experience": "2nd", "industry_domain": ["ComputationalFluidDynamics", "MachineLearning", "AutomobileEngineering", "Mechanicalengineer", "DataEngineering", "Marketing", "DeepLearning"], "job_title": ["ComputationalFluidDynamics", "MachineLearning", "AutomobileEngineering", "Mechanicalengineer", "DataEngineering", "Marketing", "DeepLearning"], "keyphrases": ["akbar quraishi", "india", "united states", "additional experience", "programming c python create solutions", "support main applications", "knowledge", "latest technologies", "challenging work", "linkedin", "linkedincominakbarquraishi", "github", "githubcomakbarmq01", "angellist", "angelcoamq14", "languages technologies", "python", "ros c c opencv numpy pytorch keras deep learning gstreamer nvidia deepstream sdk docker kubernetes darknet exposure deep learning models", "yolo fastrcnn resnet unet neural networks", "professional experience", "yantraai technologies computer vision engineer", "pune building", "industrial use case applications based deep learning applications", "video analytics", "deepstream", "present development", "human safety application", "nvidiadeepstream sdk", "yolov3 model", "multiple video streams", "worked homography tool", "opencv", "object movement", "classification detection", "performance modules", "hardware", "industry appropriate performance set", "jenkins pipeline", "automated testing", "robotic cell manager", "optical character recognition", "ocr", "digital meter", "reading", "ssh api communication edge device host machine setting object detection model", "nvidia xavier safety gear detections warehouse security building", "gstreamer pipelines deepstream sdk deep learning based object detection module camera calibrations", "distortions", "eel 3705", "digital logic design assisted students", "digital logic concepts", "flipflops latches state machines", "lab sessions supervised projects altera de2115 cyclone ivfpga quatrus prime eel 474 6 microcontroller based system design completion objectives", "energia code composer studio ides designed lab session ti mspexp430f5529lp microcontroller", "assisted students", "successful florida department transportation computer engineer research assistant", "prototyped design rectification circuit", "provide interface lightning surge input pic24 processor", "resulting analysis", "peakdrop curve", "specific client requirements", "requirements", "workflow data", "basic system reporting specifications", "prototyped design rectification circuit", "provide interface", "lightning surge input pic24 processor", "opc", "concept resulting analysis", "ad converter", "programmed mplab pic24 kit sampling", "820s surge", "embedded c", "automated data sampling", "python backup data ssd avoid device failure", "collected data surges", "data sampling", "existing protection standards", "ieee c62412 standards", "published traffic engineering operations education ms electrical engineering", "florida state university", "us bs", "electrical electronics engineering", "rgtu", "india academic projects", "dynamic performance", "apr18650", "lithiumion cell electrical engineer analysis eis model", "experimental simulated results", "liion cell", "performed charge discharge cycles", "dut", "different c rates", "neware battery analyser", "mathematical model", "simulink liion cell", "get simulated chargedischarge profiles", "experimental results", "real time operations", "battery discharge dynamics", "explore share experience camping sites", "yelpcamp", "ui", "vanilla js", "semantic target users common outdoor activities", "mean stack", "restful routing concepts", "entire application use", "javascript", "developers", "passport js middleware user authentication", "malicious user", "quasi static load flow analysis electrical engineer load flow fault analysis", "reduced runtime", "implementing newton raphson algorithm load flow studies", "python", "connected bus", "load load analysis", "various bus locations", "impact", "pv", "2nd place state inter college senior design expo rgtu trainee bharat heavy electricals limited crompton greaves skills training deployment deep learning models pytorch keras", "software applications", "shell perl scripts linux os gstreamer pipeline buildup basler camera object classification module", "creating regression", "artificial neural network models", "svms decision trees", "key courses", "security", "wireless networks", "microprocessors microcontrollers computer system architecture languages"], "language_known": ["english", "urdu"], "location": ["india", "united states", "pune", "yantra"], "name": "akbar quraishi pune", "phones": ["999.378.8632"], "raw_text": " \n\nAKBAR ​QURAISHI \n\nPune, India \n(+91)999.378.8632 \nakbarmq01@gmail.com \n \n \n\n \n\n \n\n \n\nHighly motivated ​Electrical Engineer with experience in R&D, Software & Computer vision applications from ​Florida\n \nState University, United States​. Additional experience includes programming in C++, Python to create solutions,\n \n \ninterfaces and support for main applications.  \nA quick learner that desires to acquire knowledge on latest technologies and get involved in challenging work.  \n\n \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nLinkedIn: ​linkedin.com/in/akbar-quraishi \n\nGitHub: ​github.com/Akbarmq01 \n\nAngelList: ​angel.co/amq14 \n\n>LANGUAGES AND TECHNOLOGIES \n\n●\n\n●\n\nProficient:​ Python, ROS,C/ C++, OpenCV, Numpy,Pytorch, Keras, Deep Learning, GStreamer, Nvidia \nDeepstream SDK, Docker, Kubernetes, Darknet, \nExposure:​ Deep Learning models(YOLO, fastRCNN, Resnet, U-NET), Neural networks, \n\n>PROFESSIONAL EXPERIENCE \nYantraAI Technologies | Computer Vision Engineer| Pune, IN\nBuilding Industrial use case applications based on deep learning applications​  \n\n●\n\nVideo Analytics on Deepstream \n\n  ​2019 - Present \n\n \n\n \n\n \n\n●\n\nDevelopment  of  Human safety  application on Nvidia-Deepstream SDK using YOLOv3 model.  \nGstreamer pipeline set up for multiple video streams. \n\n●\n● Worked on a Homography tool using OpenCV to track object movement on a 2D map. \n\n● Deep Inspector by Yantra \n\n●\n\n●\n\n●\n\nBuilding a product for industrial inspection through classification & detection  Deep Learning models. \nTested the performance of modules and hardware to verify Industry appropriate performance. \nSet up a Jenkins pipeline for automated testing. \n\n●\n\nRobotic cell Manager \n\n● Optical Character recognition(OCR) for digital meter reading. \n●\n\nCreating SSH API for communication between Edge device  and host machine. \nSetting up an object detection model in Nvidia Xavier for Safety gear detections. \n\n●\n\n● Warehouse Security  \n\n●\n\n●\n\nBuilding Gstreamer pipelines in Deepstream SDK for deep learning based object detection module. \nCamera calibrations to reduce distortions. \n\n2017 - 2018 \n\n \nFlorida State University | Teaching Assistant \n\nEEL 3705 Digital Logic Design \n\n●\n\n●\n\n●\n\n●\n●\n\n●\n\n●\n\nAssisted Students in understanding the Digital Logic concepts on Flip-flops, Latches, State Machines. \nInstructed Lab sessions and supervised Projects on ALtera DE2-115 cyclone IV/FPGA, Quatrus Prime. \n\nEEL 474​ 6 Microcontroller Based System Design \ncompletion of objectives using Energia and Code Composer Studio IDEs. \n\n●\n\n \n\n \n\n \n\nDesigned Lab session for TI MSP-EXP430F5529LP Microcontroller and assisted students in successful\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nFlorida Department of Transportation​ ​ | Computer Engineer, Research Assistant                                               ​2015 - 2016 \nPrototyped design of rectification circuit to provide an interface for lightning surge input to PIC24 processor, resulting \nin analysis of peak-drop curve \n\nCollects and researches specific client requirements for projects, identifies requirements, gathers workflow \ndata and basic system and reporting specifications \nPrototyped design of rectification circuit to provide an interface for lightning surge input to PIC24 processor  \nusing OPC Concept, resulting in analysis of peak-drop curve \n\n\f●\n\n●\n\n●\n\nDesigned AD converter and programmed MPLAB PIC24 kit for sampling 8/20μs surge utilizing embedded C and \nautomated data sampling with Python to backup data to SSD to avoid device failure. \nAnalysed the collected data from the surges and performed data sampling to verify the existing protection \nstandards. \nPerformed SPD testing following IEEE C62.41.2 standards ​ published under Traffic Engineering and Operations \n\n  \n>EDUCATION \nM.S. Electrical Engineering, ​Florida State University, ​US\nB.S. Electrical & Electronics Engineering, ​RGTU, ​India\n>ACADEMIC PROJECTS \nModeling the Dynamic Performance Of APR18650 Lithium-ion Cell | Electrical Engineer\nAnalysis of EIS model by comparing Experimental and simulated results on Li-ion cell  \n\n \n\n \n\n2016 \n2013 \n \n\n2018 \n\n \n\n2014 \n2012 \n \n\n \n\n \n\nPerformed Charge/ discharge cycles on the DUT at different C rates using Neware battery analyser. \n\n●\n● Used the mathematical model(Simulink) of Li-ion cell to get the simulated charge/discharge profiles and \n\n●\n\n●\n\ncompare it with the experimental results. \nThe results showed that the model proposed could be used to study the real time  operations  of  Li-ion  batteries \nunder  test​. \nPerformed Mathematical modelling of LiO battery in matlab/C, to understand & verify battery discharge dynamics. \n2017 \n\nYelpCamp | Software Engineer\nWeb application that allows uses to explore and share their experience on camping sites . ​ ​YelpCamp \n\nDesigned a UI using vanilla JS , HTML5/CSS,UI Semantic to target users with common outdoor activities. \n\n●\n● Used MEAN stack with RESTful routing concepts to keep the entire application use JavaScript which helped  \n\n                developers to easily understand and follow the code \n\n●\n\nIntegrated Passport JS and middleware for user authentication that prevented any malicious user to alter the  \ndatabase. \n\nQuasi Static Load Flow Analysis | Electrical Engineer\nLoad flow and fault analysis on a New England bus system power grid with PV injection.  \n\n2015 \n\n●\n\n●\n\n●\n\nReduced runtime by 20% through implementing Newton Raphson Algorithm for load flow studies in Python. \nStudied impact of transients transients on the PV connected Bus and performed load load analysis for \nremaining buses in the system.   \nDiscussed the vulnerability of the grid by PV Installation on  Various Bus Locations and showed the Impact \nWith and Without PV on Adjacent Bus. \n\n>AWARDS + CERTIFICATIONS \n2nd Place State and Inter College Senior Design Expo, ​RGTU\nTrainee, ​Bharat Heavy Electricals limited, Crompton & Greaves\n>SKILLS \n\n●\n●\n●\n●\n\nTraining and deployment of Deep learning models in Pytorch, Keras. \nAutomating Software applications using shell, Perl scripts on LINUX OS. \nGstreamer pipeline buildup for basler camera on object classification module in Deepstream. \nExperience in creating Regression &  Artificial Neural Network models, SVMs, Decision Trees, etc.  \n\n>Key Courses \n\nComputer Networks and Security \n\n●\n● WIreless Networks  \n●\n● Microprocessors and Microcontrollers  \n\nComputer System Architecture \n\n>Languages \n\nEnglish, Hindi,Urdu. \n\n\f", "resume_file": "ResumeAkbarQuraishi_1y", "technical_skills": ["keras", "traffic engineering", "workflow", "js", "c", "bus system", "engineering", "vulnerability grid", "support", "javascript", "linux", "docker", "analytics", "numpy", "map deep", "ssh api", "design", "testing", "python", "security", "liion", "semantic", "interface lightning", "deep learning", "computer engineer", "yantraai", "github", "software", "authentication", "languages", "neware", "deep learning models yolo fastrcnn resnet unet neural networks"]}