{"cleantext": "specific responsibilities include developing statistical natural language understanding nlu models elevate customer experience ensuring data quality throughout stages acquisition processing including data sourcingcollection ground truth generation normalization transformation crosslingual alignmentmapping auditing metrics data success criteria work engineers develop efficient data querying infrastructure offline online use cases basic qualifications degree highly quantitative field cs machine learning mathematics statistics equivalent experience experience r python weka sas matlab statisticalmachine learning software experience applying various machine learning techniques understanding key parameters affect performance experience developing experimental analytic plans data modeling processes use strong baselines ability accurately determine cause effect relationships understanding relevant statistical measures confidence intervals significance error measurements development evaluation data sets etc preferred qualifications 3 years experience machine learning statistical modeling data mining analytics techniques experience one natural language processing topics tagging syntactic parsing word sense disambiguation topic modeling contextual text mining application deep learning nlp previous experience ml data scientist role large technology company fluency language english", "education": [], "industry_domain": ["MachineLearning", "Mechanicalengineer", "Finance"], "jd_file": "Job", "job_title": ["MachineLearning", "Mechanicalengineer", "Finance"], "keyphrases": ["specific responsibilities", "statistical natural language understanding", "nlu models", "customer experience", "data quality", "stages", "acquisition processing", "data sourcingcollection", "ground truth generation normalization transformation", "crosslingual alignmentmapping", "auditing metrics data success criteria", "work engineers", "efficient data querying infrastructure", "degree", "highly quantitative field", "r python weka sas matlab statisticalmachine learning software experience", "various machine learning techniques", "key parameters", "affect performance experience", "experimental analytic plans", "strong baselines", "cause effect relationships", "relevant statistical measures", "confidence intervals", "significance error measurements", "preferred qualifications 3 years experience", "machine learning", "statistical modeling", "data mining", "analytics", "techniques", "experience", "tagging", "syntactic parsing", "word sense", "disambiguation topic modeling", "contextual text mining application", "deep learning", "nlp previous experience"], "language_known": ["english"], "location": [], "raw_text": "Specific responsibilities include: \nDeveloping statistical natural language understanding (NLU) models that elevate the customer experience.\nEnsuring data quality throughout all stages of acquisition and processing, including data sourcing/collection, ground truth generation, normalization, transformation, and cross-lingual alignment/mapping.\nAuditing metrics data and success criteria.\nWork with engineers to develop efficient data querying infrastructure for both offline and online use cases.\nBasic Qualifications\nBachelor or Master's degree in highly quantitative field (CS, machine learning, mathematics, statistics) or equivalent experience.\nExperience with R, Python, Weka, SAS, Matlab or other statistical/machine learning software.\nExperience applying various machine learning techniques, and understanding the key parameters that affect their performance.\nExperience developing experimental and analytic plans for data modeling processes, use of strong baselines, and the ability to accurately determine cause and effect relationships.\nUnderstanding of relevant statistical measures such as confidence intervals, significance of error measurements, development and evaluation data sets, etc.\nPreferred Qualifications\n3+ years of experience with machine learning, statistical modeling, data mining, and analytics techniques.\nExperience in one or more natural language processing topics: tagging, syntactic parsing, word sense disambiguation, topic modeling; contextual text mining, and application of deep learning to NLP.\nPrevious experience in a ML or data scientist role with a large technology company.\nFluency in a language other than English", "technical_skills": ["python", "data mining", "deep learning nlp", "matlab", "topic modeling", "data querying", "text mining", "analytics", "natural language processing", "software", "data scientist", "natural language understanding", "syntactic parsing", "data modeling"]}